# GetValues Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalDemandFactorDefinition..::..GetValues Method
ElectricalDemandFactorDefinition Class See Also
---
Provides access to the value set stored with this demand factor definition
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ICollection<ElectricalDemandFactorValue> GetValues()
```

Visual Basic
---
```text
Public Function GetValues As ICollection(Of ElectricalDemandFactorValue)
```

Visual C++
---
```text
public:
ICollection<ElectricalDemandFactorValue^>^ GetValues()
```

# See Also
ElectricalDemandFactorDefinition Class
Autodesk.Revit.DB.Electrical Namespace